Revit 2026 API

# ButtonDataText Property

---

The user-visible text of the button.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Text { get; set; }
```
```vb
Public Property Text As String
	Get
	Set
```
```cpp
public:
property String^ Text {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member Text : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when setting the value to . |
| ArgumentException | Thrown when setting the value to an empty string, or when the value contains invalid characters. |

#### Reference

ButtonData Class

Autodesk.Revit.UI Namespace